app/views/application_mailer/like_email.html.erb

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 68], ["LIMIT", 1]]
---
<p>
  Game ID: <%= Game.find(@like.game_id).id %><br>