app/controllers/games_controller.rb

SELECT  "games".* FROM "games" ORDER BY "games"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."game_id" = ?  [["game_id", 54]]
---
  def index
    games = Game.all.map do |x|
      {
        id: x.id,
        name: x.name,
        year: x.year,
        publisher: x.manufacturer,
        active: x.active,
        url: request.url + x.image.url,
        description: x.description,
        likes: x.likes.count