app/controllers/likes_controller.rb

  def index
    @likes = Like.all
---
SELECT "likes".* FROM "likes"

  def add_like
    @game = Game.find(params[:liked][:game_id])
    @client_ip = request.remote_ip
    @timestamp = params[:liked][:timestamp]
    @most_recent = Like.where(:game_id => @game.id, :ip_address => @client_ip).last
    if (!@most_recent.nil? && @most_recent.liked_at > 5.minutes.ago)
      return
    end

    @like = Like.new
    @like.game_title = @game.name
    @like.liked_at = @timestamp
    @like.ip_address = @client_ip
    @like.game_id = @game.id

    respond_to do |format|
      if @like.save
        @count = Like.where(:game_title => @game.name).count
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 91], ["LIMIT", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."game_id" = ? AND "likes"."ip_address" = ? ORDER BY "likes"."id" DESC LIMIT ?  [["game_id", 56], ["ip_address", "127.0.0.1"], ["LIMIT", 1]]
INSERT INTO "likes" ("game_title", "liked_at", "ip_address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["game_title", "Space Invaders"], ["liked_at", "2018-04-12 23:11:43"], ["ip_address", "127.0.0.1"], ["created_at", "2018-04-12 23:11:43.405564"], ["updated_at", "2018-04-12 23:11:43.405564"]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."game_title" = ?  [["game_title", "Space Invaders"]]

    def set_like
      @like = Like.find(params[:id])
---
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", 91], ["LIMIT", 1]]